# KOSULLU ELEMAN ISLEMLERI

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])

In [2]:
df["var1"]

0    28
1    26
2    12
3    16
4    10
5    17
6     1
7    10
8    13
9    29
Name: var1, dtype: int32

In [3]:
df["var1"][0:2]

0    28
1    26
Name: var1, dtype: int32

In [6]:
df[0:2][["var1","var2"]]

   var1  var2
0    28     9
1    26     8

In [11]:
df[df.var1 > 15] #kosulu girerek degerleri bize getirir.

   var1  var2  var3
0    28     9    29
1    26     8    13
3    16    25    22
5    17    22     7
9    29    14    24

In [13]:
df[(df.var1 > 15) & (df.var3 < 10)]

   var1  var2  var3
5    17    22     7

In [17]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
0    28     9
1    26     8
3    16    25
5    17    22
9    29    14

In [19]:
df[(df.var1 > 15)][["var1","var3"]]

   var1  var3
0    28    29
1    26    13
3    16    22
5    17     7
9    29    24